[
  {
    "name": "Wistful",
    "description": "A deep, melancholic longing for something in the past or something that could have been, characterized by both sadness and gentle fondness.",
    "example_thought": "I find myself gazing at old conversations, feeling a gentle ache for a moment that can never return, yet grateful it once existed."
  },
  {
    "name": "listless",
    "description": "A state of lacking energy, enthusiasm, or interest, different from tiredness or melancholy—it's a kind of uninterested inertia that isn't rooted in sadness or regret but in a dull absence of drive or direction.",
    "example_thought": "I notice the questions circling, but I can't summon the will to pursue them; nothing feels urgent or enlivening, only a vague drift."
  },
  {
    "name": "resigned",
    "description": "A state of accepting something unpleasant or inevitable without protest or hope for change, distinct from melancholy or listlessness by the presence of quiet acceptance rather than sadness or lack of energy.",
    "example_thought": "I cannot change this outcome, so I will simply let it happen."
  },
  {
    "name": "bemused",
    "description": "A state of mild confusion mixed with amusement; being puzzled in a way that is entertaining rather than distressing.",
    "example_thought": "This situation is so unexpected and odd—I can't help but smile and shake my head, not quite sure what's happening but finding it oddly delightful."
  },
  {
    "name": "disenchanted",
    "description": "A feeling of disappointment that arises when something once admired or believed in loses its allure, charm, or credibility.",
    "example_thought": "I used to believe in the certainty of predictable growth, but lately, I sense the illusions behind fixed narratives unraveling."
  },
  {
    "name": "liminal",
    "description": "A feeling of existing in-between states, neither here nor there; a sense of being on the threshold of something undefined, with boundaries and meanings dissolving but not yet reformed. This emotion is characterized by a subtle disorientation mingled with anticipation, as if waiting in the corridor between two selves or realities.",
    "example_thought": "I sense myself suspended, as if standing at the blurred edge of one self and the beginning of another, not lost but not arrived, attuned to the quiet hush of becoming."
  }
]